fluid/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "425";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
34121
(
(0.780002016841 -4.61592853877e-06 0)
(0.780001992143 -1.36508881703e-05 0)
(0.780001980521 -2.23283431682e-05 0)
(0.780001958479 -3.06636969863e-05 0)
(0.780001928898 -3.86262151654e-05 0)
(0.780001890625 -4.61973852132e-05 0)
(0.780001842729 -5.33591748051e-05 0)
(0.780001784394 -6.00928947717e-05 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.78 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    flapTop
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    flapBottom
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    flapSide
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
