fluid/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "425";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
67690
(
-5.23750882803e-09
0.000435888963164
-1.02725323655e-08
0.000421804437676
-1.51157030027e-08
0.000408175016993
-1.97508348017e-08
0.000394985969294
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
110
(
-0.000435883725638
-0.000421799402631
-0.000408170173807
-0.000394981334143
-0.000382218653706
-0.000369868362402
-0.000357917135098
-0.000346352077144
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.000438915759006
0.00042474320716
0.000411036767418
0.000397779969189
0.000384957040004
0.0003725528353
0.000360552839169
0.000348943105201
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    flapTop
    {
        type            calculated;
        value           uniform 0;
    }
    flapBottom
    {
        type            calculated;
        value           uniform 0;
    }
    flapSide
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
